#+TITLE: DAT445 Exam, March 2022
#+options: toc:nil
#+OPTIONS: ^:nil

** Answer

#+begin_src python :results output :exports code
  with open("my_groceries.txt") as f:
    for line in f:
      fields = line.split()
      n = len(fields)
      if n < 3:
          print("Invalid line:", line)
      else:
        want = int(fields[-1].strip())
        have = int(fields[-2].strip())
      if want > have:
        print(" ".join(fields[0:-2]),want - have)
#+end_src

#+RESULTS:
: flour 1
: salt 1
: blue cheese 2

* Question 3

Implement the class Tracker which is used for tracking the GPS positions of different objects. The
class must have the following methods:
1. An __init__ method which initializes a tracker with no pre-existing tracking information. (3 points)
2. A method addPosition(object_name, latitude, longitude) which adds the current GPS
position (latitude and longitude) for the object with the given name. (4 points)
3. A method printPath(object_name) which prints the path traveled by the given object. The
path is simply the sequence of GPS coordinates visited by the object. (4 points)
4. A method pathLength(object_name) which returns the total length of the path traversed by
the object. The total length is the sum of the lengths of the lines between every two
consequent GPS coordinates. If there are less than two GPS positions for an object, then
the total length is 0. The length of a line between two GPS positions is computed by using
the haversine function given bellow. (6 points)

#+INCLUDE: "haversine.py" src python

The following is an example for how the class Tracker can be used:
    
#+begin_src python :results output :exports both
from q3 import Tracker

tr = Tracker()
tr.addPosition("A",32.0004311,-103.548851)
tr.addPosition("A",33.374939,-103.6041946)
tr.addPosition("A",31.102422,-105.9668979)
tr.addPosition("SB Multisal",57.68633,11.97719)
tr.printPath("A")
print(tr.pathLength("A"))
tr.printPath("SB Multisal")
print(tr.pathLength("SB Multisal"))
#+end_src

#+RESULTS:
: 32.0004311 -103.548851
: 33.374939 -103.6041946
: 31.102422 -105.9668979
: 489.54312772451726
: 57.68633 11.97719
: 0

